<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the latest version of Jamf Connect</string>
    <key>Identifier</key>
    <string>com.github.coppercorp.pkg.JamfConnect</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Jamf Connect</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.coppercorp.download.JamfConnect</string>
	<key>Process</key>
	<array>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/unpack</string>
			<key>flat_pkg_path</key>
			<string>%pathname%/JamfConnect.pkg</string>
			<key>purge_destination</key>
			<true/>
		</dict>
		<key>Processor</key>
		<string>FlatPkgUnpacker</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/payload</string>
			<key>pkg_payload_path</key>
			<string>%RECIPE_CACHE_DIR%/unpack/JamfConnect.pkg/Payload</string>
			<key>purge_destination</key>
			<true/>
		</dict>
		<key>Processor</key>
		<string>PkgPayloadUnpacker</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>info_path</key>
			<string>%RECIPE_CACHE_DIR%/payload/Applications/Jamf Connect.app/Contents/Info.plist</string>
			<key>plist_keys</key>
			<dict>
				<key>CFBundleShortVersionString</key>
				<string>version</string>
				<key>LSMinimumSystemVersion</key>
				<string>min_os_version</string>
			</dict>
		</dict>
		<key>Processor</key>
		<string>PlistReader</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>pkg_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			<key>source_pkg</key>
			<string>%pathname%/JamfConnect.pkg</string>
		</dict>
		<key>Processor</key>
		<string>PkgCopier</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>path_list</key>
			<array>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</array>
		</dict>
		<key>Processor</key>
		<string>PathDeleter</string>
	</dict>
	</array>
</dict>
</plist>