<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the current release version of Quickbooks ODBC Driver for Mac.</string>
    <key>Identifier</key>
    <string>com.github.coppercorp.pkg.QuickbooksODBCDriver</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Quickbooks ODBC Driver</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.coppercorp.download.QuickbooksODBCDriver</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.dmg/*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>