<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Quickbooks ODBC Driver.</string>
	<key>Identifier</key>
    	<string>com.github.coppercorp.download.QuickbooksODBCDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Quickbooks ODBC Driver</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>Version: ([0-9]+.[0-9]+.[0-9]+)</string>
				<key>url</key>
				<string>https://www.cdata.com/drivers/quickbooks/download/odbc/#macos</string>
                <key>result_output_var_name</key>
                <string>version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(https:\/\/s3.amazonaws.com\/.*.dmg)</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>http://www.cdata.com/download/getfile.aspx?file=demo/RQDG-M/setup.dmg&amp;name=QuickBooks%20ODBC%20Driver%20for%20Mac</string>
                <key>result_output_var_name</key>
                <string>downloadurl</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
				<key>url</key>
				<string>%downloadurl%</string>
			</dict>
			<key>Processor</key>
			<string>CURLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/CData ODBC Driver for QuickBooks.pkg</string>
				<key>expected_authority_names</key>				<array>					<string>Developer ID Installer: CDATA Software, Inc. (D5Z3TZNB33)</string>					<string>Developer ID Certification Authority</string>					<string>Apple Root CA</string>				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
