<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages latest YubiKey Manager</string>
    <key>Identifier</key>
    <string>com.github.coppercorp.pkg.YubiKeyManager</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>YubiKey Manager</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.apfelwerk.download.yubikey_manager</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>overwrite</key>
				<false/>
				<key>source_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
	</array>
</dict>
</plist>

