<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Docker full installer disk image. amd64 = intel, arm64 = Silicon</string>
    <key>Identifier</key>
    <string>com.github.coppercorp.download.docker</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Docker</string>
        <key>TYPE</key>
        <string>amd64</string>
    </dict>
    <key>Process</key>
    <array>
	   <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
              <key>url</key>
              <string>https://www.docker.com/get-started</string>
              <key>result_output_var_name</key>
              <string>url_to_download</string>
              <key>re_pattern</key>
              <string>((\w+):\/\/(\S*)(%TYPE%)(\S*)(dmg)(?=\?))</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url_to_download%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
          <key>input_path</key>
          <string>%pathname%/%NAME%.app</string>
          <key>strict_verification</key>
          <true/>
          <key>deep_verification</key>
          <true/>
          <key>requirement</key>
          <string>identifier "com.docker.docker" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9BNSXJN65R"</string>
        </dict>
      </dict>
    </array>
</dict>
</plist>
