<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.coppercorp.pkg.SublimeText4</string>
	<key>Description</key>
	<string>Packages the latest Sublime Text 4</string>
	<key>Input</key>
	<dict>
        <key>NAME</key>
        <string>SublimeText4</string>
        <key>BUNDLEID</key>
        <string>com.jetbrains.intellij</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.gregneagle.download.SublimeText4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%input_path%</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%found_basename%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>%BUNDLEID%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
