<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Cisco Webex Meetings.</string>
        <key>Identifier</key>
        <string>com.github.coppercorp.download.CiscoWebexMeetings</string>
        <key>Input</key>
        <dict>
            <key>DOWNLOAD_URL</key>
            <string>https://akamaicdn.webex.com/client/webexapp.dmg</string>
            <key>NAME</key>
            <string>Cisco Webex Meetings</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Cisco (DE8Y96K9QP)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                    <key>strict_verification</key>
                    <true/>
                    <key>deep_verification</key>
                    <true/>
                    <key>input_path</key>
                    <string>%pathname%/Cisco Webex Meetings.pkg</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>