<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Parallels Desktop</string>
	<key>Identifier</key>
	<string>com.github.coppercorp.download.ParallelsDesktop</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>17</string>
		<key>NAME</key>
		<string>Parallels Desktop</string>
		<key>PLATFORM_ARCH</key>
		<string>image</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME% %MAJOR_VERSION%.dmg</string>
				<key>url</key>
				<string>https://www.parallels.com/directdownload/pd%MAJOR_VERSION%/%PLATFORM_ARCH%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Parallels Desktop.app</string>
				<key>strict_verification</key>
				<false/>
				<key>deep_verification</key>
				<true/>
				<key>requirement</key>
				<string>identifier "com.parallels.desktop.console" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4C6364ACXT"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>